TEMP/Documents/COV_СертификатОВакцинацииОтCOVID.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>COV_СертификатОВакцинацииОтCOVID</Name>
			<BasedOn>
				<xr:Item>Document.COV_ПрохождениеВакцинацииОтCOVID</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.COV_СертификатыОВакцинацииОтCOVID</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.COV_ПрохождениеВакцинацииОтCOVID</v8:Type>
						<v8:Type>cfg:DocumentRef.COV_ПрохождениеВакцинацииГрупповой</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипВакцины</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.COV_ТипыВакцины</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоДействияСертификата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецДействияСертификата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СертификатДействителен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеДействияССертификатом</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредыдущийСертификат</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.COV_СертификатОВакцинацииОтCOVID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

TEMP/InformationRegisters/COV_ПрохождениеВакцинацииОтCOVID.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>COV_ПрохождениеВакцинацииОтCOVID</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Компонент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПрививки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидВакцины</Name>
					<Type>
						<v8:Type>cfg:EnumRef.COV_ВидыВакцинации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипВакцины</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.COV_ТипыВакцины</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаВакцинации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

TEMP/Documents/COV_СертификатОВакцинацииОтCOVID/Ext/ManagerModule.bsl
Функция ДезактивироватьСертификат(Сертификат, ПричинаДезактивации = "") Экспорт 
	Перем Результат;
	Результат = Новый Структура("Сертификат, Успешно, ТекстОшибки", Сертификат, Истина, "");
	Попытка
		ОбъектСертификата = Сертификат.ПолучитьОбъект();
		ОбъектСертификата.СертификатДействителен = Ложь;
		ОбъектСертификата.ОснованиеДействияССертификатом = ПричинаДезактивации;
		ОбъектСертификата.Записать();
		Возврат Результат;
	Исключение
		мОписаниеОшибки = ОписаниеОшибки();
		Результат.ТекстОшибки = мОписаниеОшибки;
		Результат.Успех = Ложь;
		Возврат Результат;
	КонецПопытки;
	
КонецФункции


Функция ПолучитьВозможностьСозданияСертификата(ДокументВакцинации, Сотрудник) Экспорт 
	Перем СтруктураРезультата;
	СтруктураРезультата = Новый Структура("Возможность, Данные, ТекстПричины");
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ДокументВакцинации);
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Запрос.Текст = "ВЫБРАТЬ
	|	МАКСИМУМ(COV_ПрохождениеВакцинацииОтCOVID.Компонент) КАК Компонент
	|ПОМЕСТИТЬ вт_МаксимальныйКомпонент
	|ИЗ
	|	РегистрСведений.COV_ПрохождениеВакцинацииОтCOVID КАК COV_ПрохождениеВакцинацииОтCOVID
	|ГДЕ
	|	COV_ПрохождениеВакцинацииОтCOVID.Регистратор = &Ссылка
	|	И COV_ПрохождениеВакцинацииОтCOVID.Сотрудник = &Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	COV_ПрохождениеВакцинацииОтCOVID.ДатаВакцинации КАК ДатаВакцинации,
	|	COV_ПрохождениеВакцинацииОтCOVID.ТипВакцины КАК ТипВакцины,
	|	ЕСТЬNULL(СуществующиеСертификаты.Ссылка, 0) КАК Сертификат,
	|	COV_ПрохождениеВакцинацииОтCOVID.Компонент <> COV_ПрохождениеВакцинацииОтCOVID.ТипВакцины.КоличествоКомпонентов КАК Отказ,
	|	COV_ПрохождениеВакцинацииОтCOVID.Компонент КАК КомпонентВакцины
	|ИЗ
	|	вт_МаксимальныйКомпонент КАК вт_МаксимальныйКомпонент
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.COV_ПрохождениеВакцинацииОтCOVID КАК COV_ПрохождениеВакцинацииОтCOVID
	|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|				COV_СертификатОВакцинацииОтCOVID.Ссылка КАК Ссылка,
	|				COV_СертификатОВакцинацииОтCOVID.НачалоДействияСертификата КАК НачалоДействияСертификата,
	|				COV_СертификатОВакцинацииОтCOVID.Сотрудник КАК Сотрудник
	|			ИЗ
	|				Документ.COV_СертификатОВакцинацииОтCOVID КАК COV_СертификатОВакцинацииОтCOVID
	|			ГДЕ
	|				НЕ COV_СертификатОВакцинацииОтCOVID.ПометкаУдаления) КАК СуществующиеСертификаты
	|			ПО COV_ПрохождениеВакцинацииОтCOVID.ДатаВакцинации = СуществующиеСертификаты.НачалоДействияСертификата
	|				И COV_ПрохождениеВакцинацииОтCOVID.Сотрудник = СуществующиеСертификаты.Сотрудник
	|		ПО вт_МаксимальныйКомпонент.Компонент = COV_ПрохождениеВакцинацииОтCOVID.Компонент
	|ГДЕ
	|	COV_ПрохождениеВакцинацииОтCOVID.Регистратор = &Ссылка
	|	И COV_ПрохождениеВакцинацииОтCOVID.Сотрудник = &Сотрудник
	|";
	
	
	Результат = Запрос.Выполнить().Выбрать();
	СтруктураРезультата.Данные = СтруктураИзВыборки(Результат);
	СтруктураРезультата.Возможность = Истина;
	Результат.Сбросить();
	
	Если Результат.Следующий() Тогда 
		Если Результат.Сертификат <> 0 Тогда 
			СтруктураРезультата.ТекстПричины = "Сертификат уже создан: 
			|" + Результат.Сертификат;
			СтруктураРезультата.Возможность = Ложь;
		КонецЕсли;
		Если Результат.ДатаВакцинации = NULL Или Результат.Отказ Тогда 
			СтруктураРезультата.ТекстПричины = "Получено недостаточно компонентов вакцины: " + Результат.КомпонентВакцины;
			СтруктураРезультата.Возможность = Ложь;
		КонецЕсли;
		
		Возврат СтруктураРезультата;
	Иначе   // недостижимый код
		СтруктураРезультата.ТекстПричины = "Недостаточно компонентов вакцины получено: " + Результат.КомпонентВакцины;
		СтруктураРезультата.Возможность = Ложь;
	КонецЕсли;
	Возврат СтруктураРезультата;	
КонецФункции

Функция СтруктураИзВыборки(Выборка)
	МассивРезультата = Новый Массив;
	Пока Выборка.Следующий() Цикл
		Поля = Новый Структура;
		Для каждого Колонка Из Выборка.Владелец().Колонки Цикл
			Поля.Вставить(Колонка.Имя);
		КонецЦикла;
		ЗаполнитьЗначенияСвойств(Поля, Выборка);
		МассивРезультата.Добавить(Поля);
	КонецЦикла;
	
	Возврат МассивРезультата;
	
КонецФункции

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Поля.Добавить("Дата");
	Поля.Добавить("Номер");
	Поля.Добавить("СертификатДействителен");
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Представление = "Сертификат о вакцинации " + ?(Данные.СертификатДействителен, "(А)", "(-)") + " " + Данные.Номер + " от " + Формат(Данные.Дата, "ДФ=dd.MM.yyyy");
КонецПроцедуры
